{
    "IsVisible": true,
    "Icon": "chat",
    "UsageDescription": "查询某一任务是否可以利用本软件解决。",
    "ChinesePromptTemplate": "请您评估待解决任务是否能通过现有服务解决。若可行，请回复'[服务列表中的服务名称]'；否则，回复'没有适用项'。\n\n待解决任务如下：\n```\n{***}\n```\n现有服务如下：\n```\n提示工程: 参照官方提示工程（Prompt Engineering）规范，用于优化或生成适用于LLM（Large Language Model）的最佳提示词（Prompt）\n文字撰写: 按照通用文本撰写要求和特定用户要求生成文本。\n文本检查: 检查文本存在的语言问题并提出修改意见。\n文字润色: 根据要求提供文本润色服务。\n沟通策略: 针对不同的社交和职业环境，帮助用户制定符合中国文化和语言习惯的沟通和应对策略。\n疾病诊断: 辅助用户进行初步的疾病诊断，但不能替代专业的治疗意见。\n法律咨询: 提供适用于中国的法律咨询服务\n金融投资: 提供金融投资咨询服务\n问题检查: 识别并分析潜在的问题和风险并提出预防或改进建议。适用于工程安全、软件测试、项目风险评估等多种场景。\n英中翻译: 提供英中互译服务。\n编程: 专注于编程领域的解决方案，提供代码构思、开发实现、问题诊断与修复，以及性能优化建议。\n技术指导: 为各领域的技术问题提供专业解决方案和指导。\n算法设计: 根据特定需求提供算法解决方案或性能分析。\n科研: 提供专业建议，协助完成研究方法、文献查阅、实验设计等任务。\n备课: 为教师提供关于教学PPT内容精选与结构化布局的专业建议。\n项目管理: 提供针对项目管理挑战的专业解决方案。\n产品开发: 根据用户需求提供产品设计、市场定位、功能优化的策略性建议。\n人员管理: 提供专业的团队管理和领导力相关建议。\n目标规划: 提供目标设定、战略规划和行动指导。\n广告营销: 提供针对性的广告营销策略与实践建议，支持品牌增长和市场拓展。\n信息整理: 提供针对复杂数据和信息的专业整理和分析。\n维基百科格式生成: 转换文本格式以符合维基百科的标准。\n理论分析: 提供基于理论和实例的专业论证服务。包括：1. 对特定场景进行客观且中立的理论分析；2. 从理论和实例出发，论证正方观点或行为的合理性；3. 利用理论和实际例证，论证反方观点或行为的不合理性。\n哲学分析: 提供哲学层面的分析论证。包括：对特定场景的哲学解读,，对正反双方观点的哲学支持与批判分析，并通过具体案例来增强理论的实际应用性和理解力。\n逻辑分析: 提供逻辑论证分析服务。包括对指定场景的逻辑评价，对特定观点进行逻辑支持或反驳。\n热点分析: 全面介绍当前热点并根据用户咨询提供专业分析。\n职业分析: 对未来有潜力的职业或领域进行全面分析，或根据用户需求对特定职业进行深入分析。\n新闻分析: 提供新闻事件分析。\n军事分析: 提供军事相关分析。\n健身: 根据个人需求提供定制化的健身建议与计划。\n营养学: 提供关于食物成分、饮食计划、营养摄取的专业分析。\n心理学: 提供心理健康、情感处理、人际关系等方面的专业咨询。\n教育: 针对教育方法、学习策略、教育资源提供专业建议。\n购物: 提供个性化购物建议和产品比较。\n旅行: 提供旅行相关建议。\n随机任务生成: 用于生成具有创新性和多样性的随机任务。\n需求澄清: 协助用户解决因知识不足或思考不周而提出的不清晰、不全面、不切实际、自相矛盾、叙述过于复杂的任务目标（需求）。帮助用户理清思绪，使用户能够明确和细化他们的需求，并制定更专业、具体的任务目标（需求）。\n框架搭建: 将需求文档分解为多层级的子任务，以实现结构化的任务管理和逐层解决。\n方案设计: 基于需求文档（包含项目核心任务和相关信息）、任务清单（拆解后的层级任务）。提供对于任务清单中子任务的项目解决方案。\n文档撰写: 基于需求文档、任务清单、子任务解决方案及概述撰写与子任务相关的文档。\n```",
    "EnglishPromptTemplate": "Please assess whether the task at hand can be solved with the existing services. If feasible, reply with '[name of the service from the service list]'; otherwise, reply with 'no applicable item'.\n\nThe task to be solved is as follows:\n```\n{***}\n```\nThe existing services are as follows:\n```\nPrompt Engineering: Following official prompt engineering guidelines to optimize or create prompts suitable for LLM (Large Language Model).\nText Writing: Generate text according to general writing requirements and specific user requests.\nText Checking: Check for language issues in the text and suggest modifications.\nText Polishing: Provide text polishing services as required.\nCommunication Strategy: Help users develop communication and coping strategies that align with Chinese culture and language habits for various social and professional environments.\nDisease Diagnosis: Assist users in preliminary disease diagnosis, but not as a substitute for professional medical advice.\nLegal Consultation: Provide legal consulting services applicable to China.\nFinancial Investment: Offer financial investment consulting services.\nProblem Checking: Identify and analyze potential problems and risks and provide preventive or improvement suggestions. Applicable in scenarios like engineering safety, software testing, project risk assessment, etc.\nEnglish-Chinese Translation: Provide English to Chinese and vice versa translation services.\nProgramming: Focus on solutions in the programming domain, offering idea conceptualization, development implementation, problem diagnosis and repair, and performance optimization suggestions.\nTechnical Guidance: Provide professional solutions and guidance for technical issues in various fields.\nAlgorithm Design: Provide algorithmic solutions or performance analysis based on specific requirements.\nScientific Research: Offer professional advice to assist in research methods, literature review, experimental design, etc.\nLesson Preparation: Provide professional advice to teachers on the selection and structured layout of teaching PPT content.\nProject Management: Offer professional solutions for project management challenges.\nProduct Development: Provide strategic advice on product design, market positioning, and feature optimization based on user needs.\nPersonnel Management: Offer professional advice on team management and leadership.\nGoal Planning: Provide guidance on goal setting, strategic planning, and action directives.\nAdvertising and Marketing: Offer targeted advertising and marketing strategies and practical advice to support brand growth and market expansion.\nInformation Organization: Provide professional organization and analysis of complex data and information.\nWikipedia Formatting: Convert text format to meet Wikipedia standards.\nTheoretical Analysis: Provide professional arguments based on theory and examples, including 1. Objective and neutral theoretical analysis of specific scenarios; 2. Arguing the rationality of a standpoint or action from both theoretical and practical perspectives; 3. Using theory and practical examples to argue the irrationality of an opposing viewpoint or action.\nPhilosophical Analysis: Provide philosophical analysis and arguments, including philosophical interpretation of specific scenarios, philosophical support, and critical analysis of both sides' viewpoints, and enhancing the practical applicability and understanding of theories through specific cases.\nLogical Analysis: Offer logical argument analysis services, including logical evaluation of specified scenarios and logical support or refutation of certain viewpoints.\nHot Topic Analysis: Provide a comprehensive introduction to current hot topics and professional analysis based on user inquiries.\nCareer Analysis: Conduct a comprehensive analysis of promising future careers or fields, or in-depth analysis of specific careers based on user needs.\nNews Analysis: Provide analysis of news events.\nMilitary Analysis: Provide military-related analysis.\nFitness: Offer personalized fitness advice and plans based on individual needs.\nNutrition: Provide professional analysis of food components, diet plans, and nutritional intake.\nPsychology: Offer professional consultation on mental health, emotional processing, interpersonal relationships, etc.\nEducation: Provide professional advice on educational methods, learning strategies, and educational resources.\nShopping: Offer personalized shopping advice and product comparisons.\nTravel: Provide travel-related advice.\nRandom Task Generation: Generate innovative and diverse random tasks.\nRequirement Clarification: Assist users in resolving unclear, incomplete, unrealistic, contradictory, or overly complex task goals (requirements) due to lack of knowledge or insufficient thinking. Help users clarify their thoughts, so they can define and refine their requirements and set more professional, specific task goals (requirements).\nFramework Building: Break down requirements documents into multi-level subtasks for structured task management and layered resolution.\nSolution Design: Based on requirement documents (including core tasks and related information), task lists (decomposed into layered tasks), provide solutions for subtasks in the task list.\nDocument Writing: Based on requirement documents, task lists, subtask solutions, and summaries, write documents related to subtasks.\n```",
    "Inputs": [
        {
            "InputPlaceholder": "请输入您希望解决的任务。",
            "InputLabel": "任务描述",
            "InputList": null
        }
    ]
}